%----------------------------------------------------------------------------------------%
%
% Υπολογισμός της μετρικής SAD (Sum of Absolute Differences) δοσμένων δύο μακρομπλόκ
%
% Είσοδος
%       currentBlk : Tο μπλοκ του οποίου υπολογίζουμε το SAD
%       refBlk : To μπλοκ στο οποίο γίνεται ο υπολογισμός της μετρικής SAD
%
% Έξοδος
%       cost : το SAD για τα δύο μακρομπλοκ
%
%----------------------------------------------------------------------------------------%


function cost = costFuncSAD(currentBlk,refBlk)


err = 0;
for i = 1:16
    for j = 1:16
        err = err + abs((currentBlk(i,j) - refBlk(i,j)));
    end
end
cost = err;