%--------------------------------------------------------------------------------------%
%
% Βρίσκει ποιο μακρομπλοκ στο imgI μας έδωσε ελάχιστο κόστος
%
% Είσοδος
%   costs : Πίνακας που περιέχει το κόστος υπολογισμού για το μακρομπλόκ
%
% Έξοδος
%   dx : Διάνυσμα κίνησης στηλών  (κάθετη μετατόπιση)
%   dy : Διάνυσμα κίνησης γραμμών (οριζόντια μετατόπιση)
%
%--------------------------------------------------------------------------------------%


function [dx, dy, min] = minCost(costs)

[row, col] = size(costs);

%--------------------------------------------------------------------------------------%
% Έλεγχος για το εάν το κόστος του υπάρχοντος στοιχείου είναι μικρότερο από το
% min που έχουμε ήδη. Εάν είναι μικρότερο, τίθεται αυτό ελάχιστο και πραγματοποιείται
% η μετατόπιση (dx,dy)
%--------------------------------------------------------------------------------------%

min = 65537; % Αρχικοποίηση min

for i = 1:row
    for j = 1:col
        if (costs(i,j) < min)
            min = costs(i,j);
            dx = j; dy = i;
        end
    end
end




